---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.NothingToApplyWarning
source: html/3c703fb8-89c6-84fd-73b2-4b45d28a765d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.NothingToApplyWarning Property

Start and end elevations are the same, nothing to Apply.

## Syntax (C#)
```csharp
public static FailureDefinitionId NothingToApplyWarning { get; }
```